brew list

abseil
act
age
ansible
aom
apr
apr-util
aribb24
autoconf
avro-c
bash-completion
bazelisk
bdw-gc
berkeley-db
bottom
brotli
buildifier
c-ares
ca-certificates
cairo
capstone
cffi
cheat
cjson
cmake
colima
coreutils
dav1d
difftastic
docker-buildx
dust
expect
ffmpeg
fish
flac
flyway
fontconfig
freetype
frei0r
fribidi
fzf
gawk
gdbm
gettext
gh
giflib
git
git-lfs
glib
gmp
gnu-sed
gnu-tar
gnu-time
gnupg
gnutls
go
google-java-format
gradle
graphite2
groovy
grpcurl
guile
harfbuzz
helm
highway
icu4c
imath
jansson
jenv
jpeg
jpeg-turbo
jpeg-xl
jq
json-c
kafka
kcat
krb5
kubernetes-cli
lame
leptonica
lftp
libarchive
libass
libassuan
libb2
libbluray
libevent
libffi
libgcrypt
libgpg-error
libidn2
libksba
libnet
libnghttp2
libogg
libpng
libpq
libpthread-stubs
librdkafka
librist
libsamplerate
libserdes
libslirp
libsndfile
libsodium
libsoxr
libssh
libtasn1
libtiff
libtool
libunibreak
libunistring
libusb
libuv
libvidstab
libvmaf
libvorbis
libvpx
libwebsockets
libx11
libxau
libxcb
libxdmcp
libxext
libxrender
libyaml
lima
little-cms2
lua
lz4
lzlib
lzo
m4
macos-term-size
maven
mbedtls
mongodb-community-shell
mongosh
mpdecimal
mpfr
mpg123
msodbcsql18
mssql-tools18
navi
ncurses
nettle
node
node@14
node@16
npth
oniguruma
opencore-amr
openexr
openjdk
openjdk@11
openjdk@17
openjpeg
openldap
openssl@1.1
openssl@3
opus
p11-kit
p7zip
pango
pcre
pcre2
perl
pinentry
pixman
pkg-config
protobuf
pv
pycparser
pyenv
python-certifi
python-cryptography
python@3.10
python@3.11
python@3.8
python@3.9
pyyaml
qemu
ranger
rav1e
readline
ripgrep
rubberband
ruby
rustup-init
sdl2
shellcheck
six
skaffold
skhd
snappy
socat
sops
speex
sqlite
srt
starship
subversion
svt-av1
tcl-tk
tcptraceroute
telnet
terraform
tesseract
theora
tmux
tree
ttyd
unbound
unixodbc
utf8proc
vde
vhs
vim
watch
webp
x264
x265
xorgproto
xvid
xz
yabai
yadm
yajl
yq
zeromq
zimg
zookeeper
zoxide
zstd
alacritty
docker
eclipse-ide
firefox
font-noto-color-emoji
font-noto-mono-for-powerline
google-cloud-sdk
google-drive
intellij-idea
jdk-mission-control
nosqlbooster-for-mongodb
obsidian
postman
sensiblesidebuttons
steam
thunderbird
visual-studio-code
visualvm
