Brewfile

tap "beeftornado/rmtree"
tap "bufbuild/buf"
tap "datawire/blackbird"
tap "fluxcd/tap"
tap "hashicorp/tap"
tap "homebrew/bundle"
tap "homebrew/cask-fonts"
tap "homebrew/services"
tap "koekeishiya/formulae"
tap "microsoft/mssql-release"
tap "mongodb/brew"
tap "txn2/tap"
tap "universal-ctags/universal-ctags"
brew "act"
brew "age"
brew "ca-certificates"
brew "python@3.11"
brew "ansible"
brew "bash-completion"
brew "bazelisk"
brew "bottom"
brew "buildifier"
brew "glib"
brew "cheat"
brew "cmake"
brew "gmp"
brew "unbound"
brew "gnutls"
brew "python@3.9"
brew "qemu"
brew "lima"
brew "colima"
brew "coreutils"
brew "difftastic"
brew "docker-buildx"
brew "dust"
brew "expect"
brew "fish"
brew "openjdk"
brew "flyway"
brew "fzf"
brew "gawk"
brew "gh"
brew "git"
brew "git-lfs"
brew "gnu-sed"
brew "gnu-tar"
brew "gnu-time"
brew "gnupg"
brew "go"
brew "google-java-format"
brew "gradle"
brew "groovy"
brew "grpcurl"
brew "helm"
brew "jenv"
brew "jq"
brew "kafka"
brew "librdkafka"
brew "kcat"
brew "kubernetes-cli"
brew "lftp"
brew "libpq", link: true
brew "maven"
brew "node@16"
brew "mongosh"
brew "navi"
brew "node"
brew "python@3.10"
brew "p7zip"
brew "protobuf"
brew "pv"
brew "pyenv"
brew "python@3.8"
brew "ranger"
brew "ripgrep"
brew "rustup-init"
brew "shellcheck"
brew "skaffold"
brew "socat"
brew "sops"
brew "starship"
brew "subversion"
brew "tcptraceroute"
brew "telnet"
brew "tmux"
brew "tree"
brew "unixodbc"
brew "vhs"
brew "vim"
brew "watch"
brew "yadm"
brew "yq"
brew "zoxide"
brew "hashicorp/tap/terraform"
brew "koekeishiya/formulae/skhd"
brew "koekeishiya/formulae/yabai", args: ["HEAD"]
brew "microsoft/mssql-release/msodbcsql18"
brew "microsoft/mssql-release/mssql-tools18"
brew "mongodb/brew/mongodb-community-shell"
cask "alacritty"
cask "docker"
cask "eclipse-ide"
cask "firefox"
cask "font-noto-color-emoji"
cask "font-noto-mono-for-powerline"
cask "google-cloud-sdk"
cask "google-drive"
cask "intellij-idea"
cask "jdk-mission-control"
cask "nosqlbooster-for-mongodb"
cask "obsidian"
cask "postman"
cask "sensiblesidebuttons"
cask "steam"
cask "thunderbird"
cask "visual-studio-code"
cask "visualvm"
vscode "alefragnani.Bookmarks"
vscode "andyyaldoo.vscode-json"
vscode "BazelBuild.vscode-bazel"
vscode "beaglefoot.awk-ide-vscode"
vscode "bmalehorn.vscode-fish"
vscode "ckolkman.vscode-postgres"
vscode "cweijan.vscode-myssql-client2"
vscode "eamodio.gitlens"
vscode "emeraldwalk.RunOnSave"
vscode "golang.go"
vscode "ilkka.google-java-format"
vscode "jnoortheen.nix-ide"
vscode "lemrod.vscode-mqsc"
vscode "linhmtran168.mac-ca-vscode"
vscode "madhavd1.javadoc-tools"
vscode "marlon407.code-groovy"
vscode "mathiasfrohlich.Kotlin"
vscode "mechatroner.rainbow-csv"
vscode "miyamotoh.vscal2"
vscode "mrmlnc.vscode-json5"
vscode "ms-azuretools.vscode-docker"
vscode "ms-kubernetes-tools.vscode-kubernetes-tools"
vscode "ms-vscode-remote.remote-containers"
vscode "mtxr.sqltools"
vscode "mtxr.sqltools-driver-mssql"
vscode "mtxr.sqltools-driver-mysql"
vscode "mtxr.sqltools-driver-pg"
vscode "naco-siren.gradle-language"
vscode "redhat.java"
vscode "redhat.vscode-commons"
vscode "redhat.vscode-yaml"
vscode "robole.snippets-ranger"
vscode "rust-lang.rust-analyzer"
vscode "salesforce.bazel-vscode"
vscode "samuelcolvin.jinjahtml"
vscode "serayuzgur.crates"
vscode "shalimski.swapdiff"
vscode "signageos.signageos-vscode-sops"
vscode "SonarSource.sonarlint-vscode"
vscode "spmeesseman.vscode-taskexplorer"
vscode "StackBuild.bazel-stack-vscode"
vscode "StackBuild.bazel-stack-vscode-go"
vscode "streetsidesoftware.code-spell-checker"
vscode "tamasfe.even-better-toml"
vscode "timonwong.shellcheck"
vscode "vadimcn.vscode-lldb"
vscode "VisualStudioExptTeam.intellicode-api-usage-examples"
vscode "VisualStudioExptTeam.vscodeintellicode"
vscode "vmware.vscode-manifest-yaml"
vscode "vscjava.vscode-gradle"
vscode "vscjava.vscode-java-debug"
vscode "vscjava.vscode-java-dependency"
vscode "vscjava.vscode-java-pack"
vscode "vscjava.vscode-java-test"
vscode "vscjava.vscode-maven"
vscode "xoronic.pestfile"
vscode "yzhang.markdown-all-in-one"
vscode "zxh404.vscode-proto3"
